Ran Plan for dir: `projects/dev` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform plan -input=false -refresh -out \"/root/.atlantis/repos/goboolean/infrastructure/108/default/projects/dev/default.tfplan\"" in "/root/.atlantis/repos/goboolean/infrastructure/108/default/projects/dev": exit status 1
data.vault_kv_secret_v2.argocd: Reading...
data.vault_kv_secret_v2.postgresql: Reading...
module.acme.tls_private_key.private_key: Refreshing state... [id=3b6fbbc04df1b62ea59e2ed339f7bef7243ccf98]
module.acme.acme_registration.reg: Refreshing state... [id=https://acme-staging-v02.api.letsencrypt.org/acme/acct/182146964]
data.vault_kv_secret_v2.argocd: Read complete after 0s [id=kv-v2/data/infra/argocd]
data.vault_kv_secret_v2.postgresql: Read complete after 0s [id=kv-v2/data/infra/postgresql]
module.gce.google_compute_firewall.allow_http_https: Refreshing state... [id=projects/goboolean-448812/global/firewalls/allow-http-https]
module.service.google_project_service.services["container.googleapis.com"]: Refreshing state... [id=goboolean-448812/container.googleapis.com]
module.service.google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=goboolean-448812/iam.googleapis.com]
module.service.google_project_service.services["compute.googleapis.com"]: Refreshing state... [id=goboolean-448812/compute.googleapis.com]
module.service.google_project_service.services["serviceusage.googleapis.com"]: Refreshing state... [id=goboolean-448812/serviceusage.googleapis.com]
module.gcs.google_storage_bucket.terraform_state: Refreshing state... [id=goboolean-terraform-state]
module.service.google_project_service.services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=goboolean-448812/cloudresourcemanager.googleapis.com]
module.gce.google_compute_address.static_ip: Refreshing state... [id=projects/goboolean-448812/regions/asia-northeast3/addresses/atlantis-static-ip]
module.iam.google_service_account.atlantis: Refreshing state... [id=projects/goboolean-448812/serviceAccounts/atlantis@goboolean-448812.iam.gserviceaccount.com]
module.gke.google_compute_network.vpc: Refreshing state... [id=projects/goboolean-448812/global/networks/goboolean-448812-vpc]
module.gke.data.google_client_config.default: Reading...
module.gke.data.google_client_config.default: Read complete after 0s [id=projects/"goboolean-448812"/regions/"asia-northeast3"/zones/<null>]
module.gke.data.google_container_engine_versions.gke_version: Reading...
module.gke.data.google_container_engine_versions.gke_version: Read complete after 0s [id=2025-02-03 18:53:04.693575781 +0000 UTC]
module.iam.google_project_iam_member.compute_network_admin: Refreshing state... [id=goboolean-448812/roles/compute.networkAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.iam_admin: Refreshing state... [id=goboolean-448812/roles/resourcemanager.projectIamAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.compute_instance_admin: Refreshing state... [id=goboolean-448812/roles/compute.instanceAdmin.v1/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.owner: Refreshing state... [id=goboolean-448812/roles/owner/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_storage_bucket_iam_member.terraform_state_access: Refreshing state... [id=b/goboolean-terraform-state/roles/storage.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_admin: Refreshing state... [id=goboolean-448812/roles/container.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.service_account_admin: Refreshing state... [id=goboolean-448812/roles/iam.serviceAccountAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.gce.google_compute_instance.default: Refreshing state... [id=projects/goboolean-448812/zones/asia-northeast3-a/instances/atlantis]
module.iam.google_project_iam_member.service_account_user: Refreshing state... [id=goboolean-448812/roles/iam.serviceAccountUser/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.storage_admin: Refreshing state... [id=goboolean-448812/roles/storage.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.gke.google_compute_subnetwork.subnet: Refreshing state... [id=projects/goboolean-448812/regions/asia-northeast3/subnetworks/goboolean-448812-subnet]
module.acme.acme_certificate.certificate: Refreshing state... [id=224e11bc-998b-e278-dd24-d91d3595adf3]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/goboolean-448812/locations/asia-northeast3-a/clusters/goboolean-448812-gke]
module.gke.google_container_node_pool.primary_nodes: Refreshing state... [id=projects/goboolean-448812/locations/asia-northeast3-a/clusters/goboolean-448812-gke/nodePools/goboolean-448812-gke]
module.namespace.kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
module.namespace.kubernetes_namespace.kafka: Refreshing state... [id=kafka]
module.namespace.kubernetes_namespace.istio-system: Refreshing state... [id=istio-system]
module.namespace.kubernetes_namespace.fetch-system: Refreshing state... [id=fetch-system]
module.namespace.kubernetes_namespace.harbor: Refreshing state... [id=harbor]
module.namespace.kubernetes_namespace.vault: Refreshing state... [id=vault]
module.namespace.kubernetes_namespace.etcd: Refreshing state... [id=etcd]
module.namespace.kubernetes_namespace.opentelemetry: Refreshing state... [id=opentelemetry]
module.namespace.kubernetes_namespace.argocd: Refreshing state... [id=argocd]
module.kafka.helm_release.kafka: Refreshing state... [id=kafka]
module.opentelemetry.helm_release.opentelemetry_collector: Refreshing state... [id=opentelemetry-collector]
module.cert_manager.kubernetes_secret.cloudflare_api_token: Refreshing state... [id=cert-manager/cloudflare-api-token-secret]
module.istio.helm_release.istio_base: Refreshing state... [id=istio-base]
module.vault.helm_release.vault: Refreshing state... [id=vault]
module.cert_manager.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.harbor.helm_release.harbor: Refreshing state... [id=harbor]
module.etcd.helm_release.etcd: Refreshing state... [id=etcd]
module.harbor.kubernetes_manifest.harbor_gateway: Refreshing state...
module.istio.kubernetes_manifest.istio_gateway: Refreshing state...
module.argocd.kubernetes_manifest.argocd_cmp_plugin: Refreshing state...
module.cert_manager.kubernetes_manifest.cluster_issuer: Refreshing state...
module.argocd.helm_release.argocd: Refreshing state... [id=argocd]
module.cert_manager.kubernetes_manifest.wildcard_certificate: Refreshing state...
module.vault.kubernetes_manifest.vault_gateway: Refreshing state...
module.istio.helm_release.istiod: Refreshing state... [id=istiod]
module.argocd.kubernetes_secret.argocd_vault_plugin_credentials: Refreshing state... [id=argocd/argocd-vault-plugin-credentials]
module.argocd.kubernetes_manifest.argocd_gateway: Refreshing state...
module.istio.helm_release.istio_ingressgateway: Refreshing state... [id=istio-ingressgateway]
module.cloudflare.cloudflare_dns_record.istio-gateway: Refreshing state... [id=5b3805bf479bd12a29aad2877a6cfdfa]
╷
│ Error: Namespace required
│ 
│   with module.postgresql.kubernetes_manifest.postgresql-init-script,
│   on ../../modules/infra/postgresql/main.tf line 1, in resource "kubernetes_manifest" "postgresql-init-script":
│    1: resource "kubernetes_manifest" "postgresql-init-script" {
│ 
│ Resources of type '/v1, Kind=ConfigMap' require a namespace
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.argocd.data.kubernetes_secret.argocd_initial_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "argocd_initial_password" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-initial-admin-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cloudflare.cloudflare_dns_record.istio-gateway will be updated in-place
  ~ resource "cloudflare_dns_record" "istio-gateway" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "34.47.92.167" -> (known after apply)
      ~ created_on          = "2025-01-28T12:03:24Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "5b3805bf479bd12a29aad2877a6cfdfa"
      ~ meta                = jsonencode(
            {
              - auto_added             = false
              - managed_by_apps        = false
              - managed_by_argo_tunnel = false
            }
        ) -> (known after apply)
      ~ modified_on         = "2025-01-28T12:03:24Z" -> (known after apply)
        name                = "*.goboolean.io"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.istio.data.kubernetes_service.istio_ingressgateway will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "istio_ingressgateway" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "istio-ingressgateway"
          + namespace        = "istio-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.namespace.kubernetes_namespace.postgresql will be created
  + resource "kubernetes_namespace" "postgresql" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "postgresql"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```
</details>

